In [2]:
import pandas as pd
import numpy as np

In [3]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
bins = [10,25,35,60,100]
ages = [20,22,25,27,21,33,37,61,45,41,32,70,40]

ldata2=pd.cut(ages, bins, labels=group_names)
pd.value_counts(ldata2)

MiddleAged    4
Youth         4
YoungAdult    3
Senior        2
dtype: int64

In [4]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                   'key2':['one','two','one','two','one'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.845595 -1.066244
1    a  two  1.093578  0.426026
2    b  one -0.639845  0.756532
3    b  two  0.717590  1.081294
4    a  one -1.087152 -1.418984

In [12]:
grouped1 = df.groupby('key1')
for a, b in grouped1:
    print(a, b)

a   key1 key2     data1     data2
0    a  one  0.845595 -1.066244
1    a  two  1.093578  0.426026
4    a  one -1.087152 -1.418984
b   key1 key2     data1     data2
2    b  one -0.639845  0.756532
3    b  two  0.717590  1.081294

In [14]:
ldata = list(grouped1)
ldata

[('a',
    key1 key2     data1     data2
  0    a  one  0.845595 -1.066244
  1    a  two  1.093578  0.426026
  4    a  one -1.087152 -1.418984),
 ('b',
    key1 key2     data1     data2
  2    b  one -0.639845  0.756532
  3    b  two  0.717590  1.081294)]

In [16]:
ddata = dict(ldata)
ddata

{'a':   key1 key2     data1     data2
 0    a  one  0.845595 -1.066244
 1    a  two  1.093578  0.426026
 4    a  one -1.087152 -1.418984,
 'b':   key1 key2     data1     data2
 2    b  one -0.639845  0.756532
 3    b  two  0.717590  1.081294}

In [20]:
ddata['a']

  key1 key2     data1     data2
0    a  one  0.845595 -1.066244
1    a  two  1.093578  0.426026
4    a  one -1.087152 -1.418984

In [22]:
grouped1.mean()

         data1     data2
key1
a     0.284007 -0.686400
b     0.038872  0.918913

In [23]:
np.random.seed(12345)
frame1 = pd.DataFrame(np.random.randn(5,5),
                      columns=list('abcde'),
                      index=['joe', 'steve', 'wes', 'jim', 'travis'])
frame1

               a         b         c         d         e
joe    -0.204708  0.478943 -0.519439 -0.555730  1.965781
steve   1.393406  0.092908  0.281746  0.769023  1.246435
wes     1.007189 -1.296221  0.274992  0.228913  1.352917
jim     0.886429 -2.001637 -0.371843  1.669025 -0.438570
travis -0.539741  0.476985  3.248944 -1.021228 -0.577087

In [24]:
frame1.rename(index=str.upper)

               a         b         c         d         e
JOE    -0.204708  0.478943 -0.519439 -0.555730  1.965781
STEVE   1.393406  0.092908  0.281746  0.769023  1.246435
WES     1.007189 -1.296221  0.274992  0.228913  1.352917
JIM     0.886429 -2.001637 -0.371843  1.669025 -0.438570
TRAVIS -0.539741  0.476985  3.248944 -1.021228 -0.577087

In [28]:
frame1.loc['joe','a']

-0.20470765948471295